``` Terraform will perform the following actions:

  # aws_route53_record.influxdb-usegalaxy-internal will be destroyed
  # (because aws_route53_record.influxdb-usegalaxy-internal is not in configuration)
  - resource "aws_route53_record" "influxdb-usegalaxy-internal" {
      - allow_overwrite = true -> null
      - fqdn            = "influxdb.galaxyproject.eu" -> null
      - id              = "Z386N8B8JBC6TQ_influxdb.galaxyproject.eu_A" -> null
      - name            = "influxdb.galaxyproject.eu" -> null
      - records         = [
          - "192.52.33.1",
        ] -> null
      - ttl             = 600 -> null
      - type            = "A" -> null
      - zone_id         = "Z386N8B8JBC6TQ" -> null
    }

  # aws_route53_record.influxdb-usegalaxy-internal-new will be created
  + resource "aws_route53_record" "influxdb-usegalaxy-internal-new" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "influxdb.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_blockstorage_volume_v3.influxdb-data-new will be created
  + resource "openstack_blockstorage_volume_v3" "influxdb-data-new" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for InfluxDB"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "influxdb-new"
      + region            = (known after apply)
      + size              = 200
      + volume_type       = (known after apply)
    }

  # openstack_compute_instance_v2.influxdb-usegalaxy-new will be created
  + resource "openstack_compute_instance_v2" "influxdb-usegalaxy-new" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "vgcn~rockylinux-9-latest-x86_64~+generic+internal~20240821~36799~HEAD~5e494c7"
      + key_pair            = "cloud2"
      + name                = "influxdb.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "egress",
          + "public-influxdb",
          + "public-ping",
          + "public-ssh",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "bcdd1843d40698734e17b52cae8a703b527a1e45"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.influxdb-va-new will be created
  + resource "openstack_compute_volume_attach_v2" "influxdb-va-new" {
      + device      = "/dev/vdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```